app/controllers/main_controller.rb

  def retweet
    consumer = get_consumer()
    User.all.each do |user|
      access_token = OAuth::AccessToken.new(consumer, user.access_token, user.access_secret)

      user.searches.each do |search|
        #get tweets
        query_string = "https://search.twitter.com/search.json?q=#{CGI.escape(user.search)}&since_id=#{user.last_tweet}"
        json = access_token.get(query_string)
        results = JSON.parse(json.body)

        if results.has_key?("results") then
          results["results"].each do |tweet|
            #retweet each, should like add some logging here for response.code not in the 200 series
            access_token.post("https://api.twitter.com/1/statuses/retweet/#{tweet["id"]}.json")
            search.last_tweet = tweet["id"] if tweet["id"] > search.last_tweet
          end
        end

        search.save
---
UPDATE "users" SET "updated_at" = '2011-04-13 05:13:51.922770', "last_tweet" = 58034177790054400 WHERE ("users"."id" = 7)