app/controllers/main_controller.rb

  def authorize
    if not session.has_key?("request_token")
      redirect_to :action => "signin"
      return
    end
    request_token = session['request_token']
    access_token = request_token.get_access_token
    json = access_token.get("https://api.twitter.com/1/account/verify_credentials.json")
    userinfo = JSON.parse(json.body)
    user = User.find_or_create_by_name(userinfo["screen_name"])
    user.access_token = access_token.token
    user.access_secret = access_token.secret
    user.save!
---
INSERT INTO "users" ("name", "access_token", "access_secret", "search", "last_tweet", "created_at", "updated_at") VALUES ('scottnonnenberg', '46940769-4y5O4rSwaFuAMq36iCnM3G9kgXziN2QgmA5mvtHYo', 'wcDhdmHm3OjAAVKVOFS9m7Nx9eliLu4ALPeEjCip9g', '', NULL, '2011-05-17 03:23:07.258045', '2011-05-17 03:23:07.258045')
SELECT "users"."id" FROM "users" WHERE ("users"."name" = 'kavla') AND ("users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-04-13 05:40:23.155323', "search" = '' WHERE ("users"."id" = 8)

  def search
    if not session.has_key?("user")
      redirect_to :action => "signin"
      return
    end
    @user = User.find_by_name(session['user'])
---
SELECT "users"."id" FROM "users" WHERE ("users"."name" = 'kavla') LIMIT 1

  def save
    @user = User.find_by_name(params[:user])
    @user.search = params[:search]
    @user.save!
---
SELECT "users"."id" FROM "users" WHERE ("users"."name" = 'kavla') AND ("users".id <> 1) LIMIT 1
UPDATE "users" SET "updated_at" = '2011-04-13 05:39:32.463169', "last_tweet" = 57912397482033152 WHERE ("users"."id" = 8)

  def retweet
    consumer = get_consumer()
    User.all.each do |user|
---
SELECT "users".* FROM "users"

  def set_last_tweet(user)
    return if user.search.blank?

    consumer = get_consumer()
    access_token = OAuth::AccessToken.new(consumer, user.access_token, user.access_secret)
    query_string = "https://search.twitter.com/search.json?q=#{CGI.escape(user.search)}&rpp=1"
    json = access_token.get(query_string)
    results = JSON.parse(json.body)

    if results.has_key?("results") && results["results"].count > 0
      user.last_tweet = results["results"][0]["id"]
    else
      user.last_tweet = 1
    end

    user.save!
---
INSERT INTO "users" ("name", "updated_at", "created_at", "access_token", "search", "access_secret", "last_tweet") VALUES ('kavla', '2011-04-11 01:08:01.031161', '2011-04-11 01:08:01.031161', '28838912-6noJFzbx19jLuikJdIO78zkhZdbgmQHKX3sGlReWs', NULL, 'UfQbLpe5x5NTwbB2ioifaEIWD4mP4qogb0JQ0AiZ0', NULL)